# **Hands-on Lab : Web Scraping**

Estimated time needed: **30 to 45** minutes

## Objectives

In this lab you will perform the following:

* Extract information from a given web site 
* Write the scraped data into a csv file.

## Extract information from the given web site
You will extract the data from the below web site: <br>

In [1]:
#this url contains the data you need to scrape
url = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DA0321EN-SkillsNetwork/labs/datasets/Programming_Languages.html"

The data you need to scrape is the **name of the programming language** and **average annual salary**.<br> It is a good idea to open the url in your web broswer and study the contents of the web page before you start to scrape.

Import the required libraries

In [29]:
# Your code here
from bs4 import BeautifulSoup # this module helps in web scrapping.
import requests  # this module helps us to download a web page
import pandas as pd

Download the webpage at the url

In [30]:
#your code goes here
data  = requests.get(url).text

Create a soup object

In [31]:
#your code goes here
soup = BeautifulSoup(data,"html5lib")

Scrape the `Language name` and `annual average salary`.

In [47]:
#your code goes here
table=soup.find('table')
def get_data(table):
    language_salary_list = []
    for row in soup.find("tbody").find_all("tr"):
        col = row.find_all("td")
        language_name = col[1].text
        annual_average_salary = col[3].text
        language_salary_list.append([language_name, annual_average_salary])
    return language_salary_list

In [48]:
data=get_data(table)
data

[['Language', 'Average Annual Salary'],
 ['Python', '$114,383'],
 ['Java', '$101,013'],
 ['R', '$92,037'],
 ['Javascript', '$110,981'],
 ['Swift', '$130,801'],
 ['C++', '$113,865'],
 ['C#', '$88,726'],
 ['PHP', '$84,727'],
 ['SQL', '$84,793'],
 ['Go', '$94,082']]

In [55]:
df = pd.DataFrame(data, columns=['Language', 'Average Salary'])
df.drop(index=df.index[0], axis=0, inplace=True)
df

      Language Average Salary
1       Python       $114,383
2         Java       $101,013
3            R        $92,037
4   Javascript       $110,981
5        Swift       $130,801
6          C++       $113,865
7           C#        $88,726
8          PHP        $84,727
9          SQL        $84,793
10          Go        $94,082

In [59]:
highest_salary = df.copy()
highest_salary['Average Salary'] = highest_salary['Average Salary'].str.replace('$', '').str.replace(',', '').astype(int)
highest_salary.sort_values('Average Salary', ascending = False)

C:\Users\zl0423\AppData\Local\Temp/ipykernel_9604/3329537034.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  highest_salary['Average Salary'] = highest_salary['Average Salary'].str.replace('$', '').str.replace(',', '').astype(int)

      Language  Average Salary
5        Swift          130801
1       Python          114383
6          C++          113865
4   Javascript          110981
2         Java          101013
10          Go           94082
3            R           92037
7           C#           88726
9          SQL           84793
8          PHP           84727

Save the scrapped data into a file named *popular-languages.csv*

In [61]:
# your code goes here
df.to_csv('popular-languages.csv')